@echo off
echo ===============================现在时间是:%time%================================
title= Git自动拉取上传脚本
color 2
echo ================正在查看当前目录================
echo 当前目录是：%cd%
echo;
echo ================正在从远程拉取笔记================
C:\userapp\Git\bin\git.exe pull
echo =====================拉取成功=====================
cls
echo ==================================================================
echo                           11               11
echo                          1111             1111
echo                        11111111         1111111            
echo                       1111111111      1111111111       
echo                      1111111111111  1111111111111             
echo                      111111111111111111111111111      
echo                       1111111111111111111111111                  
echo                        11111111111111111111111            
echo                         111111111111111111111                                  
echo                          1111111111111111111
echo                           11111111111111111 
echo                            111111111111111
echo                             1111111111111
echo                              11111111111
echo                               111111111
echo                                1111111
echo                                 11111
echo                                  111
echo                                   1
echo ===================================================================
echo ================正在从本地上传笔记================
C:\userapp\Git\bin\git.exe add .
C:\userapp\Git\bin\git.exe commit -m "%date% %time%"
C:\userapp\Git\bin\git.exe push origin main
echo =====================上传成功=====================
pause 摁任意键退出
exit